app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "I'm a Programmer!"], ["updated_at", "2023-10-05 10:36:46.248679"], ["id", 7]]
---
  def update
    @project = Project.find(params[:id])

    if @project.update(project_params)