app/controllers/tasks_controller.rb

  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.create(task_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "tasks" ("description", "due_at", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Flying to Malaga"], ["due_at", "2023-10-07"], ["project_id", 4], ["created_at", "2023-10-06 12:07:53.702209"], ["updated_at", "2023-10-06 12:07:53.702209"]]